Revit 2027 API
FamilyInstance.SuperComponent Property
Property to get the super component of current family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element SuperComponent { get; }
Public ReadOnly Property SuperComponent As Element
	Get
public:
property Element^ SuperComponent {
	Element^ get ();
}
member SuperComponent : Element with get
Property Value
Element
Remarks
When the FamilyInstance has no super component, it returns null
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace